In [1]:
import seaborn as sns
import pandas as pd
from matplotlib import pyplot as plt
%matplotlib inline

/Users/colleenobrien/.pyenv/versions/3.8.0/lib/python3.8/site-packages/pandas/compat/__init__.py:117: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

In [2]:
dc = pd.read_json('data.txt', encoding='unicode_escape')

In [3]:
dc.head()

,name,total_cases,new_cases,total_deaths,new_deaths,total_recovered,active_cases,source
0,New York,"16,900","+1,110",150,+36,,"16,750",[source] [source] [source] [source] [source] [...
1,Washington,"1,996",,95,,124,"1,777",[source]
2,New Jersey,"1,914",,21,+1,,"1,893",[source] [source]
3,California,"1,802",+47,35,+1,6,"1,761",[source] [source]
4,Illinois,"1,049",,9,,2,"1,038",[source]